[
    {
        "name": "Under the Weather",
        "github": "Under-the-Weather",
        "address": "http://under-the-weather.herokuapp.com",
        "img": "/images/weather.png",
        "description": "MERN stack app that is used to track illness/injury symptoms.  This app allows users to sign up for an account and store their symptoms so they can use this information when they visit a primary care physician.  A lot of us seem to magically forget what's been going on while \"Under the Weather\" and this app is used to help that"
    },
    {
        "name": "Phrasing!",
        "github": "Phrasing-BOOM",
        "address": "https://Magic-Mayo.github.io/Phrasing-BOOM",
        "img": "/images/archerpi.png",
        "description": "This was one of the first apps I made using React.  Demonstrates the single page application and how it can be used to render content very quick.  Simple but a fun concept and small things like this can be used for practice."
    },
    {
        "name": "Park U",
        "github": "Park-U",
        "address": "http://park-u.herokuapp.com",
        "img": "/images/parku.png",
        "description": "This my first attempt at a full stack application.  I made a game from scratch that was modeled, in a way, after the original Pokemon games and was intended to be a journey through a coding bootcamp.  Uses Node.js with Express routing and a SQL database and just your standard HTML/CSS front-end with jQuery."
    },
    {
        "name": "Put Ya Thang Down...",
        "github": "Flip-It-and-Reverse-It",
        "address": "https://Magic-Mayo.github.io/Flip-It-and-Reverse-It",
        "img":"/images/flip-it.png",
        "description": "I made this app to demonstrate a little bit of front-end design and some simple functionality.  Has a theme that you may or may not pick up on ;)"
    },
    {
        "name": "Parks and Rec Trivia",
        "github": "TriviaGame",
        "address": "https://Magic-Mayo.github.io/TriviaGame",
        "img":"/images/trivia.jpg",
        "description": "In this project my goal to practice using timeout and interval functions.  I found this really useful because I see different sites or apps with content that will rotate in and out or scroll across the page at a set speed.  I know what I reinforced through this project will be something I use often so I'm glad I can do stuff like this to practice."
    },
    {
        "name": "Word Gallows",
        "github": "Word-Gallows",
        "address": "https://Magic-Mayo.github.io/Word-Gallows",
        "img": "/images/gallows.jpg",
        "description": "This was my first real project with javascript and designing/building a webpage on my own.  This was a challenge for me not only because I like to choose more difficult tasks to take on but also because there was a huge learning curve as I went into this knowing very little.  In the end I found it turned out better than I had initially hoped!"
    }
]