[
    {
        "name": "Brown Sales",
        "github": "brownsales",
        "address": "https://brownsalesflooring.com",
        "img": "brownsales.webp",
        "gif": "brownsales.gif.webp",
        "description": "Client wanted his website refactored and updated to have the ability to add and remove items he sells. Created a CMS thru contentful so customer could add and remove items himself. ",
        "technology": "React, React Router, Contentful CMS"
    },
    {
        "name": "Virtual Office Hours",
        "github": "scheduler",
        "address": "https://virtualofficehours.herokuapp.com/student",
        "img": "scheduler.webp",
        "gif": "scheduler.gif.webp",
        "description": "While working as a teaching assistant the students wanted to be able to schedule time with me outside of class.  I created this site so students could do just that.  Site was made using React, Node.js, Styled Components, React Router, Express, and nodemailer.  Use email guest@guest.user if you'd like to take a look.",
        "technology": "React, Node.js, React Router, Styled Components, Express, nodemailer"
    },
    {
        "name": "Under the Weather",
        "github": "Under-the-Weather",
        "address": "http://under-the-weather.herokuapp.com",
        "img": "weather.webp",
        "gif": "weathergif.webp",
        "description": "MERN stack app that is used to track illness/injury symptoms.  This app allows users to sign up for an account and store their symptoms so they can use this information when they visit a primary care physician.  A lot of us seem to magically forget what's been going on while \"Under the Weather\" and this app is used to help with that."
    },
    {
        "name": "Park U",
        "github": "Park-U",
        "address": "http://park-u.herokuapp.com",
        "img": "parku.webp",
        "gif": "parkugif.webp",
        "description": "This my first attempt at a full stack application.  I made a game from scratch that was modeled, in a way, after the original Pokemon games and was intended to be a journey through a coding bootcamp.  Uses Node.js with Express routing and a SQL database and just your standard HTML/CSS front-end with jQuery."
    },
    {
        "name": "Put Ya Thang Down...",
        "github": "Flip-It-and-Reverse-It",
        "address": "https://Magic-Mayo.github.io/Flip-It-and-Reverse-It",
        "img": "flipit.webp",
        "gif": "flipitgif.webp",
        "description": "I made this app to demonstrate a little bit of front-end design and some simple functionality.  Has a theme that you may or may not pick up on."
    },
    {
        "name": "Phrasing!",
        "github": "Phrasing-BOOM",
        "address": "https://Magic-Mayo.github.io/Phrasing-BOOM",
        "img": "archerpi.webp",
        "gif": "archer.webp",
        "description": "This was one of the first apps I made using React.  Demonstrates the single page application and how it can be used to render content very quick.  Simple but a fun concept and small things like this can be used for practice."
    }
]